Revit 2027 API
FabricSheet.GetWireCenterlines(WireDistributionDirection) Method
 Gets a list of curves representing the wires centerlines of the Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetWireCenterlines(
	WireDistributionDirection wireDirection
)
Public Function GetWireCenterlines (
	wireDirection As WireDistributionDirection
) As IList(Of Curve)
public:
IList<Curve^>^ GetWireCenterlines(
	WireDistributionDirection wireDirection
)
member GetWireCenterlines :
        wireDirection : WireDistributionDirection -> IList<Curve>
Parameters
wireDirection WireDistributionDirection
 The direction of wire distribution in the Fabric Sheet.
Return Value
IList<Curve>
 The centerline curves.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricSheet Class
GetWireCenterlines Overload
Autodesk.Revit.DB.Structure Namespace